articles/howtoprove.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>howtoprove</title>
<!-- 2019-10-05 Sat 22:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ambi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">howtoprove</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">How To Prove It - Notebook</a>
<ul>
<li><a href="#sec-1-1">Notes and Review</a></li>
<li><a href="#sec-1-2">Selected Exercises</a>
<ul>
<li><a href="#sec-1-2-1">Chapter 0</a>
<ul>
<li><a href="#sec-1-2-1-1">1</a></li>
<li><a href="#sec-1-2-1-2">2</a></li>
<li><a href="#sec-1-2-1-3">3</a></li>
<li><a href="#sec-1-2-1-4">4</a></li>
<li><a href="#sec-1-2-1-5">5</a></li>
<li><a href="#sec-1-2-1-6">6</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2">Chapter 1</a>
<ul>
<li><a href="#sec-1-2-2-1">1.2 Exercises</a>
<ul>
<li><a href="#sec-1-2-2-1-1">Make truth tables</a></li>
<li><a href="#sec-1-2-2-1-2">4</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2-2">1.3 Exercises</a>
<ul>
<li><a href="#sec-1-2-2-2-1">1</a></li>
<li><a href="#sec-1-2-2-2-2">3</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2-3">1.4 Exercises</a>
<ul>
<li><a href="#sec-1-2-2-3-1">1</a></li>
<li><a href="#sec-1-2-2-3-2">10</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-3">Chapter 2</a>
<ul>
<li><a href="#sec-1-2-3-1">2.1 exercises</a>
<ul>
<li><a href="#sec-1-2-3-1-1">1</a></li>
<li><a href="#sec-1-2-3-1-2">2</a></li>
<li><a href="#sec-1-2-3-1-3">4</a></li>
<li><a href="#sec-1-2-3-1-4">5</a></li>
<li><a href="#sec-1-2-3-1-5">6</a></li>
<li><a href="#sec-1-2-3-1-6">7</a></li>
<li><a href="#sec-1-2-3-1-7">8</a></li>
<li><a href="#sec-1-2-3-1-8">9</a></li>
</ul>
</li>
<li><a href="#sec-1-2-3-2">2.2 exercises</a>
<ul>
<li><a href="#sec-1-2-3-2-1">8</a></li>
<li><a href="#sec-1-2-3-2-2">11</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-2-4">Chapter 3</a>
<ul>
<li><a href="#sec-1-2-4-1">3.1 Exercises</a>
<ul>
<li><a href="#sec-1-2-4-1-1">5</a></li>
<li><a href="#sec-1-2-4-1-2">6</a></li>
<li><a href="#sec-1-2-4-1-3">7</a></li>
<li><a href="#sec-1-2-4-1-4">8</a></li>
<li><a href="#sec-1-2-4-1-5">9</a></li>
<li><a href="#sec-1-2-4-1-6">11</a></li>
</ul>
</li>
<li><a href="#sec-1-2-4-2">3.2 Exercises</a>
<ul>
<li><a href="#sec-1-2-4-2-1">8</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-1">
<h1 id="sec-1">How To Prove It - Notebook</h1>
<div class="outline-text-1" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-2">
<h2 id="sec-1-1">Notes and Review</h2>
<div class="outline-text-2" id="text-1-1">
<p>
My decision to work through this book was two-fold:
</p>
<ul class="org-ul">
<li>I wanted to spend a lot of time practicing and reading through proofs
</li>
<li>I wanted to practice writing things down in \LaTeX
</li>
</ul>

<p>
Velleman's <i>How to Prove It</i> was ideal for both of these, funnily enough, for the same reason - there are an impressive number of exercises. 
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-2">
<h2 id="sec-1-2">Selected Exercises</h2>
<div class="outline-text-2" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-3">
<h3 id="sec-1-2-1">Chapter 0</h3>
<div class="outline-text-3" id="text-1-2-1">
</div><div id="outline-container-sec-1-2-1-1" class="outline-4">
<h4 id="sec-1-2-1-1">1</h4>
<div class="outline-text-4" id="text-1-2-1-1">
<p>
<i>(a) factor 2<sup>15</sup> - 1 = 32767 into a product of two smaller positive integers</i>
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">import</span> numpy <span style="color: #F92672;">as</span> np
<span style="color: #FD971F;">target</span> = 32767
<span style="color: #FD971F;">factors</span> = []
<span style="color: #F92672;">for</span> x <span style="color: #F92672;">in</span> <span style="color: #F92672;">range</span>(<span style="color: #F92672;">int</span>(np.sqrt(target))):
  <span style="color: #F92672;">if</span> target % (x+1) == 0:
    factors.append(x+1)
<span style="color: #F92672;">return</span> factors[1], target/factors[1]
</pre>
</div>

<p>
<i>(b) Find an integer x such that 1 &lt; x &lt; 2<sup>32767</sup> - 1 and 2<sup>32767</sup> - 1 is divisible by x</i>
</p>

<p>
since \(n = 32767\) is not prime, there are positive integers \(a\) and \(b\) such that \(a < b, b < n, n = ab\) by Conjecture 2. 
</p>

<p>
2<sup>n</sup> - 1 can be written as 2<sup>ab</sup> - 1, and working backwards from the proof of conjecture 2 can be written as \((2^b - 1) * (1 + 2^b + 2^2b + ... + 2^{(a-1)b})\). We only need to know one of these numbers to know it divides 2<sup>32767</sup>, so we plug in \(b=7\) for \(2^b - 1\) and we get a value of \(x=127\)
</p>

<p>
Check: <a href="https://www.wolframalpha.com/input/?i=2^32767+-+1+mod+127">https://www.wolframalpha.com/input/?i=2^32767+-+1+mod+127</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2-1-2" class="outline-4">
<h4 id="sec-1-2-1-2">2</h4>
<div class="outline-text-4" id="text-1-2-1-2">
<p>
<i>Make some conjectures about the values of n for which 3<sup>n</sup> − 1 is prime or the values of n for which 3<sup>n</sup> − 2<sup>n</sup> is prime. (You might start by making a table similar to Figure 1.)</i>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">n</td>
<td class="right">3<sup>n</sup> - 1</td>
<td class="right">3<sup>n</sup>-2<sup>n</sup></td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">2</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">8</td>
<td class="right">5</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">26</td>
<td class="right">19</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">80</td>
<td class="right">65</td>
</tr>

<tr>
<td class="right">5</td>
<td class="right">242</td>
<td class="right">211</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">728</td>
<td class="right">665</td>
</tr>
</tbody>
</table>

<p>
3<sup>n</sup> - 1 will never be prime because 3<sup>n</sup> will always yield an odd number and any odd number - 1 is even, meaning it would be divisible by 2.
</p>

<p>
conjecture: 3<sup>n</sup> - 2<sup>n</sup> will be prime in cases where n is prime
</p>
</div>
</div>

<div id="outline-container-sec-1-2-1-3" class="outline-4">
<h4 id="sec-1-2-1-3">3</h4>
<div class="outline-text-4" id="text-1-2-1-3">
<p>
<i>The proof of Theorem 3 gives a method for finding a prime number different from any in a given list of prime numbers.</i>
</p>

<p>
<i>(a) Use this method to find a prime different from 2, 3, 5, and 7.</i>
</p>

<p>
let \(m = 2*3*5*7 + 1\), so \(m = 211\); m is not divisible by 2, 3, 5, or 7 so 211 must either be prime or there must exist a prime higher than 7. In this case, 211 is prime. 
</p>

<p>
<i>(b) Use this method to find a prime different from 2, 5, and 11.</i>
</p>

<p>
let \(m = 2*3*11 + 1\), so \(m = 67\); m is not divisible by 2, 3, or 11 so 67 must either be prime or there must exist a prime higher than 7. In this case, 67 is prime. 
</p>
</div>
</div>

<div id="outline-container-sec-1-2-1-4" class="outline-4">
<h4 id="sec-1-2-1-4">4</h4>
<div class="outline-text-4" id="text-1-2-1-4">
<p>
<i>Find five consecutive integers that are not prime.</i>
</p>

<p>
\(x = (5+1)! + 2\)
\(x = 722\)
</p>

<p>
\(a_0 \rightarrow 722 % 2 == 0\)
\(a_1 \rightarrow 723 % 3 == 0\)
\(a_2 \rightarrow 734 % 2 == 0\)
\(a_3 \rightarrow 735 % 5 == 0\)
\(a_4 \rightarrow 736 % 2 == 0\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-1-5" class="outline-4">
<h4 id="sec-1-2-1-5">5</h4>
<div class="outline-text-4" id="text-1-2-1-5">
<p>
<i>Use the table in Figure 1 and the discussion on p. 5 to find two more perfect numbers.</i>
</p>

<p>
if \(2^n - 1\) is prime, \(2^{n-1}(2^n - 1)\) is perfect
</p>

<p>
\(2^{5-1}(2^5 - 1) = 496\)
\(2^{7-1}(2^7 - 1) = 8128\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-1-6" class="outline-4">
<h4 id="sec-1-2-1-6">6</h4>
<div class="outline-text-4" id="text-1-2-1-6">
<p>
<i>The sequence 3, 5, 7 is a list of three prime numbers such that each pair of adjacent numbers in the list differ by two. Are there any more such “triplet primes”?</i>
</p>

<p>
let the set of three "triplet primes" be \(\{n, n+2, n+4\}\). For any value of n, any number in this set modulo 3 will be either {0, 2, 1}, {2, 1, 0}, and {1, 0, 2} (examples: n=3, n=5, n=4). Meaning one of the three numbers in this set must be divisible by three. Since the only prime number divisible by 3 is 3, there are no other triplet primes. 
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-2" class="outline-3">
<h3 id="sec-1-2-2">Chapter 1</h3>
<div class="outline-text-3" id="text-1-2-2">
<p>
For the most part this was just set theory review / what unions and intersections meant / etc. so I didn't do most of the exercises.
</p>
</div>

<div id="outline-container-sec-1-2-2-1" class="outline-4">
<h4 id="sec-1-2-2-1">1.2 Exercises</h4>
<div class="outline-text-4" id="text-1-2-2-1">
</div><div id="outline-container-sec-1-2-2-1-1" class="outline-5">
<h5 id="sec-1-2-2-1-1">Make truth tables</h5>
<div class="outline-text-5" id="text-1-2-2-1-1">
<p>
Pass
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2-1-2" class="outline-5">
<h5 id="sec-1-2-2-1-2">4</h5>
<div class="outline-text-5" id="text-1-2-2-1-2">
<p>
<i>Find a formula using only the connectives ∧ and ¬ that is equivalent to P ∨ Q.</i>
</p>

<p>
\(\neg(\neg P \wedge \neg Q)\)
</p>

<p>
This is just negated Demorgan's.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2-2" class="outline-4">
<h4 id="sec-1-2-2-2">1.3 Exercises</h4>
<div class="outline-text-4" id="text-1-2-2-2">
</div><div id="outline-container-sec-1-2-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-2-1">1</h5>
<div class="outline-text-5" id="text-1-2-2-2-1">
<p>
<i>Analyze the logical forms of the following statements</i>
<i>(a) 3 is a common divisor of 6, 9, and 15. (Note: You did this in exercise 2 of Section 1.1, but you should be able to give a better answer now.)</i>
</p>

<p>
{x % 3 = 0 | x = {6, 9, 15}}
</p>

<p>
<i>(b) x is divisible by both 2 and 3 but not 4.</i>
</p>

<p>
{(x % 2 = 0) ^ (x % 3 = 0) ^ &not;(x % 4 = 0)}
</p>

<p>
<i>(c) x and y are natural numbers, and exactly one of them is prime.</i>
</p>

<p>
\(x \in \mathds{N} \wedge y \in \mathds{N} \wedge \oplus\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2-2">3</h5>
<div class="outline-text-5" id="text-1-2-2-2-2">
<p>
(a) the set of all celestial objects presently or formally referred to as planets in the solar system
(b) the set of elite american universities \(\cup\) Cornell University
(c) the set of all states in the united states of america
(d) the set of all provinces in canada
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2-3" class="outline-4">
<h4 id="sec-1-2-2-3">1.4 Exercises</h4>
<div class="outline-text-4" id="text-1-2-2-3">
</div><div id="outline-container-sec-1-2-2-3-1" class="outline-5">
<h5 id="sec-1-2-2-3-1">1</h5>
<div class="outline-text-5" id="text-1-2-2-3-1">
<p>
<i>Let A = {1, 3, 12, 35}, B = {3, 7, 12, 20}, and C = {x | x is a prime number}. List the elements of the following sets. Are any of the sets below disjoint from any of the others? Are any of the sets below subsets of any others?</i>
</p>

<p>
<i>(a) A ∩ B.</i>
<i>(b) (A ∪ B) \ C.</i>
<i>(c) A ∪ (B \ C).</i>
</p>

<p>
a = {3, 12}
b = {1, 12, 20, 35}
c = {1, 12, 20, 35}
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2-3-2" class="outline-5">
<h5 id="sec-1-2-2-3-2">10</h5>
<div class="outline-text-5" id="text-1-2-2-3-2">
<p>
<i>It is claimed in this section that you cannot make a Venn diagram for four sets using overlapping circles.</i>
</p>

<p>
<i>(a) What’s wrong with the following diagram?</i>
</p>

<p>
There's no space for \(A \cup D\) or \(B \cup C\)
</p>

<p>
<i>(b) Can you make a Venn diagram for four sets using shapes other than circles?</i>
</p>

<p>
You can use a graph, I suppose.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-3">
<h3 id="sec-1-2-3">Chapter 2</h3>
<div class="outline-text-3" id="text-1-2-3">
</div><div id="outline-container-sec-1-2-3-1" class="outline-4">
<h4 id="sec-1-2-3-1">2.1 exercises</h4>
<div class="outline-text-4" id="text-1-2-3-1">
</div><div id="outline-container-sec-1-2-3-1-1" class="outline-5">
<h5 id="sec-1-2-3-1-1">1</h5>
<div class="outline-text-5" id="text-1-2-3-1-1">
<p>
<i>Analyze the logical forms of the following statements.</i>
<i>(a) Anyone who has forgiven at least one person is a saint.</i>
</p>

<p>
\(\forall x \exists y (x has forgiven y \rightarrow x is a saint)\)
</p>

<p>
<i>(b) Nobody in the calculus class is smarter than everybody in the discrete math class.</i>
</p>

<p>
\(\forall x \neg \exists y (y is smarter than x)\)
</p>

<p>
<i>(c) Everyone likes Mary, except Mary herself.</i>
</p>

<p>
\(\forall x (x likes Mary | x != Mary)\)
</p>

<p>
<i>(d) Jane saw a police officer, and Roger saw one too.</i>
</p>

<p>
\(\exists x \exists y (Jane saw (x \vee y) \wedge Roger saw (x \vee y))\)
</p>

<p>
<i>(e) Jane saw a police officer, and Roger saw him too.</i>
</p>

<p>
\(\exists x (Jane saw x \wedge Roger saw x)\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-2" class="outline-5">
<h5 id="sec-1-2-3-1-2">2</h5>
<div class="outline-text-5" id="text-1-2-3-1-2">
<p>
Giving up on reprinting the question starting now
</p>

<p>
(a) \(\forall x (x \text{ bought a rolls royce with cash} \rightarrow x \text{ has a rich uncle})\)
(b) \(\exists x \forall y (x \text{ has measles} \rightarrow y \text{ will need to be quarantined} | \text{y has a friend in the dorm})\)
(c) \(\exists x \forall y 
\exists z (x \text{ failed the test} \rightarrow \neg (\text{y will tutor z}) | \text{y got an A, z got a D})\)
(d) \(\forall x (\text{x can do it} \rightarrow \text{Jones can do it})\)
(e) \(\forall x (\text{Jones can do it} \rightarrow \text{x can do it})\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-3" class="outline-5">
<h5 id="sec-1-2-3-1-3">4</h5>
<div class="outline-text-5" id="text-1-2-3-1-3">
<p>
(a) if any man is unmarried, he is unhappy
(b) there exists a person with a child and a sister
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-4" class="outline-5">
<h5 id="sec-1-2-3-1-4">5</h5>
<div class="outline-text-5" id="text-1-2-3-1-4">
<p>
(a) Any number which is prime and not 2 is odd
(b) There exists a biggest perfect number
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-5" class="outline-5">
<h5 id="sec-1-2-3-1-5">6</h5>
<div class="outline-text-5" id="text-1-2-3-1-5">
<p>
(a) false
(b) false
(c) false
(d) true
(e) true
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-6" class="outline-5">
<h5 id="sec-1-2-3-1-6">7</h5>
<div class="outline-text-5" id="text-1-2-3-1-6">
<p>
(a) true
(b) false
(c) false
(d) true
(e) true
(f) false
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-7" class="outline-5">
<h5 id="sec-1-2-3-1-7">8</h5>
<div class="outline-text-5" id="text-1-2-3-1-7">
<p>
c is now true, d is now false, f is now true
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-1-8" class="outline-5">
<h5 id="sec-1-2-3-1-8">9</h5>
<div class="outline-text-5" id="text-1-2-3-1-8">
<p>
f is now true
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-3-2" class="outline-4">
<h4 id="sec-1-2-3-2">2.2 exercises</h4>
<div class="outline-text-4" id="text-1-2-3-2">
</div><div id="outline-container-sec-1-2-3-2-1" class="outline-5">
<h5 id="sec-1-2-3-2-1">8</h5>
<div class="outline-text-5" id="text-1-2-3-2-1">
<p>
\((\forall x \in AP(x)) \wedge (\forall x \in B(P(x)))\)
</p>

<p>
\(\forall x (x \in AP(x) \wedge x \in BP(x))\)
</p>

<p>
\(\forall x (x \in (A \cup B)P(x))\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-2-2" class="outline-5">
<h5 id="sec-1-2-3-2-2">11</h5>
<div class="outline-text-5" id="text-1-2-3-2-2">
<p>
\(\forall x (x \in A \rightarrow x \in B)\)
</p>

<p>
\(\neg \exists x (x \in A \wedge \neg(x \in B))\)
</p>

<p>
\(\forall x \neg (x \in A \wedge \neg (x \in B))\)
</p>

<p>
\(\forall x \neg (x \in A) \vee (x \in B)\)
</p>

<p>
\(\forall x (x \in A \rightarrow x \in B)\)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-3">
<h3 id="sec-1-2-4">Chapter 3</h3>
<div class="outline-text-3" id="text-1-2-4">
</div><div id="outline-container-sec-1-2-4-1" class="outline-4">
<h4 id="sec-1-2-4-1">3.1 Exercises</h4>
<div class="outline-text-4" id="text-1-2-4-1">
</div><div id="outline-container-sec-1-2-4-1-1" class="outline-5">
<h5 id="sec-1-2-4-1-1">5</h5>
<div class="outline-text-5" id="text-1-2-4-1-1">
<p>
assume a &lt; b &lt; 0. Then, -a &gt; -b &gt; 0. Since (-a)<sup>2</sup> &gt; (-b)<sup>2</sup> &gt; 0 and (-x)<sup>2</sup> = x<sup>2</sup>, a<sup>2</sup> &gt; b<sup>2</sup>.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4-1-2" class="outline-5">
<h5 id="sec-1-2-4-1-2">6</h5>
<div class="outline-text-5" id="text-1-2-4-1-2">
<p>
Assume \(1/b \geq 1/a\). Then, \(ab/b \geq ab/a\) and therefore \(a \geq b\). However, \(0 < a < b\), which is a contradiction. You could just divide both sides by \(ab\) but what's the fun in that. 
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4-1-3" class="outline-5">
<h5 id="sec-1-2-4-1-3">7</h5>
<div class="outline-text-5" id="text-1-2-4-1-3">
<p>
assume a<sup>3</sup> &gt; a. Then, a<sup>3</sup> - a &gt; 0. 
</p>

<p>
\((a^3 - a)(a^2 + 1) > 0(a^2 + 1)\)
</p>

<p>
\(a^5 - a^3 + a^3 - a > 0\)
</p>

<p>
Therefore, a<sup>5</sup> &gt; a
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4-1-4" class="outline-5">
<h5 id="sec-1-2-4-1-4">8</h5>
<div class="outline-text-5" id="text-1-2-4-1-4">
<p>
assume \(x \notin D\). Then, \(x \notin C \cap D\). Since \(x \in A\) and \(A \setminus B \subseteq, C \cap D\), then x must have been removed from A, meaning \(x \in B\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4-1-5" class="outline-5">
<h5 id="sec-1-2-4-1-5">9</h5>
<div class="outline-text-5" id="text-1-2-4-1-5">
<p>
assume \(a<b\). Then, \(a+b<b+b\). Therefore \(\frac{a+b}{2} < \frac{2b}{2} = b\)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4-1-6" class="outline-5">
<h5 id="sec-1-2-4-1-6">11</h5>
<div class="outline-text-5" id="text-1-2-4-1-6">
<p>
suppose \(ac \geq bd\). Since \(a < b\), we have \(ac \geq bd > ad\) and therefore \(ac > ad\). Therefore, \(c > d\)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4-2" class="outline-4">
<h4 id="sec-1-2-4-2">3.2 Exercises</h4>
<div class="outline-text-4" id="text-1-2-4-2">
</div><div id="outline-container-sec-1-2-4-2-1" class="outline-5">
<h5 id="sec-1-2-4-2-1">8</h5>
<div class="outline-text-5" id="text-1-2-4-2-1">
<p>
assume \(a \geq -1\). 
</p>

<p>
case 1: a = -1. Then \(1/a = -1 = 1\), which is a contradiction
case 2: a = -1 + x where x &gt; 0
</p>

<p>
$$-1 + x < \frac{1}{x-1} < b < \frac{1}{b}$$
</p>

<p>
$$(x-1)^2 < 1 < b(x-1) < \frac{1}{b}(x-1)$$
</p>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
<div id="comments">
    <p></p>
    <hr />
       <div id="disqus_thread">
           <script>
(function() {
var d = document, s = d.createElement('script');
s.src = 'https://planetbanatt.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</body>
</html>
